Revit 2026 API

# MultiServerServiceSetActiveServers(IListGuid) Method

---
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetActiveServers(
	IList<Guid> serverIds
)
```
```vb
Public Sub SetActiveServers (
	serverIds As IList(Of Guid)
)
```
```cpp
public:
void SetActiveServers(
	IList<Guid>^ serverIds
)
```
```fsharp
member SetActiveServers :
        serverIds : IList<Guid> -> unit
```

#### Parameters

serverIds IListGuid

#### Reference

MultiServerService Class

SetActiveServers Overload

Autodesk.Revit.DB.ExternalService Namespace